# ValueOutOfRange Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..ValueOutOfRange Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The value must be from 0.0 to 1.0
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ValueOutOfRange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ValueOutOfRange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ValueOutOfRange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace